<?php
  require_once($_SERVER["DOCUMENT_ROOT"]."/templates/doc_head.php");
?>
<body>
  <header class="header header--2div3 header--sportlifting">
    <div class="header__mask"></div>
    <nav class="navigation">
      <a href="javascript:void(0)" class="hamburger">
        <span class="hamburger__line"></span>
        <span class="hamburger__line"></span>
        <span class="hamburger__line"></span>
      </a>
      <a href="/index.php" class="navigation__logo">Just Space</a>
      <a href="/portfolio.php" class="navigation__section navigation__section--link">Портфолио</a>
    </nav>
  </header>
  <?php
    require_once($_SERVER["DOCUMENT_ROOT"]."/templates/sidebar.php");
  ?>
  <main class="main">
    <article class="about">
      <h1>
        Техническая поддержка и SEO сопровождение интернет-магазина
      </h1>
      <section class="about__text">
        После непосредственного создания сайта, зачастую появляется необходимость дорабатывать функционал, разрабатывать новые решения и продвигать сайт в поисковой выдаче. Особенно в этом нуждаются интернет-магазины, часто приходится внедрять готовые модули или писать кастомные, а также производить SEO-оптимизацию карточек товара и каталогов сайта.
      </section>
      <section class="about__text">
        <ul>
          <li>
            - SEO-оптимизация каталогов и карточек товаров
          </li>
          <li>
            - Глубокий рерайтинг описания каталогов и карточек товаров
          </li>
          <li>
            - Оптимизация изображений и ускорение загрузки страниц
          </li>
          <li>
            - Создание дизайна и разработка коммерческого HTML письма
          </li>
          <li>
            - Подбор и обработка изображений для страниц сайта
          </li>
          <li>
            - Обработка изображений для карточек товара
          </li>
          <li>
            - Разработка новой шапки для главной страницы сайта
          </li>
          <li>
            - Внедрение модулей, исправления экстренных ошибок
          </li>
          <li>
            - Консультирование по различным вопросам
          </li>
        </ul>
      </section>
      <section class="about__text">
        Первым делом было принято решение оптимизировать каталоги товаров в интернет-магазине, поэтому началась работа по глубокому рейрайту всего содержимого категорий, а также оптимизация мета-тегов и заголовков под определенные ключевые слова. Также были сжаты тяжелые изображения для ускорения загрузки сайта, т.к. это ведет к увеличению общей конверсии.
      </section>
      <section class="about__text">
        В рамках технической поддержки и модернизации, дизайнеру были переданы изображения карточек товара нуждающихся в обработке и разработана новая шапка для главной страницы сайта. Также было создано коммерческой HTML письмо, которое рассылалось пользователям в преддверии проведения акций с целью увеличения продаж. Периодически оказывались услуги по внедрению модулей и исправлению возникающих ошибок. Проводились консультации по всевозможным вопросам возникающих во время работы интернет-магазина.
      </section>
    </article>
  </main>
  <?php
    require_once($_SERVER["DOCUMENT_ROOT"]."/templates/footer.php");
  ?>
