<?php
    /*
     * Имя хоста, используется при подключение к базе данных
     */
    const DB_HOST = "localhost";

    /*
     * Имя базы данных, используется при подключение к базе данных
     */
    const DB_NAME = "litespace";

    /*
    * Имя администратора базы данных, используется при подключение к базе данных
    */
    const DB_USER = "litespace";

    /*
    * Пароль администратора базы данных, используется при подключение к базе данных
    */
    const DB_PASSWORD = "222271";

    /*
    * Путь к директории хранящей backup'ы
    */
    const DB_BACKUP = "/backups/";

    /*
    * Путь к mysql
    */
    const DB_MYSQL = "mysql";
?>
